ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/abstraction-rtos/source/COMPONENT_RTX/cyabs_rtos_rtxv5.c
    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_deinit_timer
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_deinit_timer(cy_timer_t* timer)
{
    cy_rslt_t       status;
    cy_rtos_error_t statusInternal;

    if (timer == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        statusInternal = osTimerDelete(*timer);
        status         = error_converter(statusInternal);

        if (status == CY_RSLT_SUCCESS)
        {
            free(*timer);
            *timer = NULL;
        }
    }

    return status;
}


/******************************************************
*                 Time
******************************************************/

cy_rslt_t cy_rtos_get_time(cy_time_t* tval)
{
    cy_rslt_t status = CY_RSLT_SUCCESS;
    uint32_t  tick_freq;

    if (tval == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        // Get Number of ticks per second
        tick_freq = osKernelGetTickFreq();

        // Convert ticks count to time in milliseconds
        if (tick_freq != 0)
        {
            *tval = (cy_time_t)((osKernelGetTickCount() * 1000LL) / tick_freq);
        }
        else
        {
            status = CY_RTOS_GENERAL_ERROR;
        }
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_delay_milliseconds
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_delay_milliseconds(cy_time_t num_ms)
{
    cy_rslt_t       status;
    cy_rtos_error_t statusInternal;

    statusInternal = osDelay(num_ms);
    status         = error_converter(statusInternal);

    return status;
}


#if defined(__cplusplus)
}
#endif
